class Solution {
    public int solution(int[][] signals) {
        /*
            [규칙]
            GYR순. 신호마다 지속시간(최소1초) 다름.
            각 신호등이 초록불 상태로 시작.
            모두 노란불이 되면 정전.
            [입력]
            신호등 n개의 신호 주기를 담은 2차원 배열
            [출력]
            모두 노란불이 되는 최소공배수를 구하는 함수 제작.
            만약 존재하지 않을 경우 -1리턴.
            [고민]
            제한사항을 잘 이해해야할 듯 하다.
            각 지속시간은 18이하이고, 모든 지속시간의 합은 20이하이다. 즉 이론적으로 최소공배수가 없다는 것은 말이 안되기에(전부 곱하면 되니) 해당 최소공배수를 구한 뒤 저 제한사항을 만족하지 않으면 -1을 리턴하게 하면 될 듯 하다.

            오늘은 많이 피곤하니 문제 이해에서 그치고, 내일 최소 어떻게 접근 방법을 설계하면 좋을지라도 시도해보자.
        */
        int answer = 0;
        return answer;
    }
}